[
    {
        "id": "missionaries_and_cannibals_2024",
        "name": "Миссионеры и каннибалы",
        "task": "Три миссионера и три аборигена-каннибала должны переплыть через реку. Их лодка может выдержать не более двух человек. И миссионеры, и аборигены могут управлять лодкой, но если на одном берегу аборигенов окажется больше чем миссионеров, то последние могут быть съедены. Необходимо найти такой план переправы (всех миссионеров и всех аборигенов), чтобы все миссионеры остались живы."
    },
    {
        "id": "family_with_children_2024",
        "name": "Семья с детьми",
        "task": "Муж с женой и двумя детьми хотят переправиться через реку. Единственный способ переплыть ее – взять лодку у рыбака, находящегося на том же берегу, что и семья. Лодка может выдержать только одного взрослого или двух детей (дети умеют грести). Может ли семья переплыть реку на этой лодке и вернуть ее рыбаку?"
    },
    {
        "id": "boys_and_soldiers_2024",
        "name": "Мальчики и солдаты",
        "task": "Два мальчика с лодкой согласились помочь трем (в общем случае 𝑁) солдатам переплыть реку. Лодка такова, что может выдержать либо одного солдата, либо двух мальчиков. И мальчики, и солдаты могут управлять лодкой. Как спланировать переправу?"
    },
    {
        "id": "jealous_couples_2024",
        "name": "Ревнивые пары",
        "task": "Необходимо переправить три пары из женихов и невест с использованием лодки, которая может выдержать только двоих. Женихи ревнивы и не могут допустить того, чтобы их невеста оказалась с чужим женихом в лодке или на берегу, если их нет рядом."
    },
    {
        "id": "people_and_monkeys_2024",
        "name": "Люди и обезьяны",
        "task": "Три человека, одна большая и две маленькие обезьяны должны переправиться через реку. Есть одна лодка, в которой может поместиться не больше двоих. Только люди и большая обезьяна умеют грести. Нельзя, чтобы оставались вместе больше обезьян, чем людей, иначе обезьяны съедят людей. Как им переправиться через реку?"
    },
    {
        "id": "father_and_sons_2024",
        "name": "Отец и сыновья",
        "task": "Отец вместе с двумя сыновьями и лодкой находится на берегу реки. Переправиться через реку можно только в лодке, грузоподъемность которой составляет 200 фунтов. Все трое умеют управлять лодкой. Отец весит 200 фунтов, а оба сына — по 100 фунтов. Как им переправиться вместе с лодкой через реку?"
    },
    {
        "id": "fear_of_the_dark_2024",
        "name": "Боязнь темноты",
        "task": "Одной семье надо пройти на другую сторону длинного, узкого и темного тоннеля. Отец может пройти сквозь тоннель за 1 минуту, мать — за 2, сын — за 4, дочь — за 5. У них есть один факел, которого хватит ровно на 12 минут. В тоннеле могут идти не больше двух человек (скорость их передвижения определяется самым медленным из них). Как семье перебраться на другую строну тоннеля, если все боятся темноты?"
    },
    {
        "id": "tower_of_hanoi_2024",
        "name": "Ханойская башня",
        "task": "Даны три стержня, на один из которых нанизаны 8 (в общем случае 𝑁) колец. Кольца отличаются размером и лежат меньшее на большем. Задача состоит в том, чтобы перенести пирамиду из колец на другой стержень. За один раз разрешается переносить только одно кольцо, причем нельзя класть большее кольцо на меньшее."
    },
    {
        "id": "knights_walk_around_the_chessboard_2024",
        "name": "Обход конем шахматной доски",
        "task": "Требуется найти способ обхода конем шахматной доски (в общем случае 𝑁 × 𝑁) из заданной начальной позиции (𝑖, 𝑗), побывав в каждой клетке только один раз."
    },
    {
        "id": "eight_queens_2024",
        "name": "Восемь ферзей",
        "task": "Требуется расставить на шахматной доске 8 ферзей так, чтобы ни один из них не находился под боем другого (в общем случае размер доски 𝑁 × 𝑁, а ферзей 𝑁)."
    },
    {
        "id": "game_15_2024",
        "name": "Игра 15",
        "task": "Имеется поле 4 x 4 (в общем случае N x N), в которое помещены 15 (N 2 - 1) занумерованных костяшек. Необходимо путем перемещения в пустую ячейку одной из соседних с ним костяшек добиться упорядоченного размещения костяшек (известно, что ровно для половины из 16! возможных начальных конфигураций решения не существует)."
    },
    {
        "id": "three_coins_2024",
        "name": "Три монеты",
        "task": "Из трех монет на столе первая и третья лежат кверху гербом, а вторая — кверху решкой. Каждый ход состоит в переворачивании двух из трех монет. Требуется сделать в точности три хода так, чтобы после них все монеты лежали одинаково — либо гербом, либо решкой кверху."
    },
    {
        "id": "jugs_of_water_2024",
        "name": "Кувшины с водой",
        "task": "Имеются два кувшина емкостью 5 и 8 галлонов. Как добиться того, чтобы в 5-галлонном кувшине оказалось в точности 2 галлона воды. Можно переливать воду из одного кувшина в другой. Не разрешается пользоваться никакими измерительными инструментами, кроме самих кувшинов."
    },
    {
        "id": "seven_bridges_of_konigsberg_2024",
        "name": "Семь кенигсбергских мостов",
        "task": "В городе Кенигсберге когда-то два острова (О1 и О2) были связаны с берегами реки (Б1 и Б2) и друг с другом 7 мостами: 2 моста О1-Б1, 2 моста О1-Б2, 1 мост О1-О2, 1 мост О2-Б1 и 1 мост О2-Б2. Требуется, начав движение с одного из берегов, пройти по каждому мосту в точности один раз и вернуться в исходную точку."
    },
    {
        "id": "train_junction_2024",
        "name": "Разъезд поездов",
        "task": "На одноколейной железной дороге встретились 2 поезда, у каждого из которых по 80 вагонов. Рядом между ними есть тупик с возможностью вместить 40 вагонов и локомотив. Как разъехаться поездам?"
    },
    {
        "id": "six_checkers_2024",
        "name": "Шесть шашек",
        "task": "На столе в ряд расположено шесть шашек: черная, белая, черная, белая, черная, белая. Слева имеется свободное место для четырех шашек. Необходимо переместить шашки так, чтобы слева оказались все белые, а справа все черные. Перемещение нужно сделать за 3 хода. За каждый ход перемещаются две шашки, расположенные рядом, на два пустых места. Раздвигать или сближать шашки нельзя."
    },
    {
        "id": "three_vessels_2024",
        "name": "Три сосуда",
        "task": "Имеется семилитровый сосуд, заполненный до краев водой. Также имеется 2 пустых сосуда на 3 и 4 литра. Как за 4 переливания сделать так, чтобы в сосуде на 3 литра было 2 литра воды?"
    },
    {
        "id": "three_piles_of_matches_2024",
        "name": "Три кучи спичек",
        "task": "Имеется 3 кучи спичек: в первой куче 11 спичек, во второй 7, в третьей 6 (всего 24 спички). Необходимо переложить спички за три перекладывания так, чтобы в каждой куче стало по 8 спичек. В любую кучу можно добавить столько спичек, сколько их в ней уже имеется."
    },
    {
        "id": "weighing_13_coins_2024",
        "name": "Взвешивание 13 монет",
        "task": "Имеется 13 монет, из которых ровно одна фальшивая. Известно, что фальшивая монета отличается от настоящих весом, но неизвестно, легче она или тяжелее. Есть чашечные весы без гирь. Требуется за 3 взвешивания найти фальшивую монету."
    },
    {
        "id": "20_pounds_of_tea_2024",
        "name": "20 фунтов чая",
        "task": "Имеется 20 фунтов чая и 10 коробок. Требуется за 9 развесов отмерить по 2 фунта в каждую коробку. В наличии имеются обычные весы с двумя чашами и 2 гири: одна на 5 фунтов, другая на 9."
    },
    {
        "id": "10_chips_2024",
        "name": "10 фишек",
        "task": "Имеется прямоугольное поле размера 4 x 6 и 10 фишек. Требуется разместить фишки таким образом, чтобы в каждой вертикальном и горизонтальном ряду их число было четным."
    },
    {
        "id": "magic_square_2024",
        "name": "Магический квадрат",
        "task": "Расположите в квадрате 3 x 3 (в общем случая, N x N) 9 (N 2) последовательных натуральных чисел так, чтобы сумма чисел в каждой строке, каждом столбце и на обеих диагоналях была одинакова."
    }
]
